'number' + 3 + 3 

// const result = 'number' + 3 + 3 // Спочатку додаємо до рядка 'number' число 3, яке автоматично буде перетворене на рядок.
// Результат: 'number' + 3 = 'number3'
// Додаємо до рядка 'number3' число 3, отримаємо 'number33'
//console.log(result);

//null + 3
//const result = null + 3; //null undefined - преобразуется в ноль
//console.log(result); //очикуваний результат 3

//5 && "qwerty"
//const result = 5 && "qwerty"; // 5 - true, qwerty - true, && повертає останнє true
//console.log(result); //очикуваний результат qwerty

//+'40' + +'2' + "hillel";
// Преобразує строку '40' у число  40
//const a = +'40';
// Преобразує строку '2' у число 2
//const b = +'2';
// Складываем два числа → 42
//const sum = a + b;
// Конкатениється зі строкою → 42 + 'hillel' = '42hillel'
//const result = sum + "hillel";
//console.log(result); // Очикуваний результат: "42hillel"

//'10' - 5 === 6;
// '10' преобразує у число 10
// 10 - 5 = 5
// 5 === 6 → false (перевірка на рівняння)
//console.log('10' - 5 === 6); // false

//true + false
// true преобразує у 1
// false преобразує у 0
// 1 + 0 = 1
//console.log(true + false); // 1

//'4px' - 3
// неможливо преобразовати у число '4px' - результат NaN
// NaN - 3 = NaN
//console.log('4px' - 3); // NaN

// '4' перетворюється у число  4
// 4 - 3 = 1
//console.log('4' - 3); // Результат 1

//'6' + 3 ** 0
//3 ** 0 означає "3 в степені 0", будь-яке число в степені 0 дає 1
// '6' + 1 = 61 число конкатенирується зі строкою
//console.log('6' + 3 ** 0);

//12 / '6'
// '6' перетворюється на число 6
// 12 / 6 = 2
//console.log(12 / '6'); // 2

//'10' + (5 === 6);
// (5 === 6) дає false, тому що це строге порівняння, а 5 не дорівнює 6
// '10' + false (рядок '10' + булеве значення false перетворюється в 'false') → '10false'
//console.log('10' + (5 === 6)); // '10false'

//null == ''
// null не рівне порожньому рядку '', оскільки вони не мають однакового значення
//console.log(null == ''); // очикуваний результат false

//3 ** (9 / 3);
// ділення 9 / 3 = 3
// число 3 возводимо до степеня 3
//відповідь 27
//console.log(3 ** (9 / 3));

//!!'false' == !!'true'
//'false' не є порожнім рядком, тому повертає true
//'true' також не є порожнім рядком 
// Оператор !! є подвійним логічним 'не'
//console.log(!!'false' == !!'true'); // результат true

//0 || '0' && 1
// Спочатку виконується '0' && 1 повертає 1
// Потім виконується 0 || 1  повертає 1
//console.log(0 || '0' && 1); // результат 1

(+null == false) < 1
// +null перетворює null на 0
// 0 == false дає true
// true (яке є 1) < 1 дає false
//console.log((+null == false) < 1); // false

//false && true || true
//&& (І) — виконується спочатку, || (АБО) — потім
//&& повертає перше "false" значення (або останнє, якщо всі "true") - false
//false || true повертаэ true
//console.log(false && true || true); // Відповідь true

false && (false || true)
//Логічний оператор OR (||) повертає true, якщо хоча б один з операндів є true - true
//Логічний оператор AND (&&) повертає true, якщо обидва операнди є true. Якщо хоча б один з операндів є false, результат буде false
console.log(false && (false || true)); // відповідь false

(+null == false) < 1 ** 5
//+null == false дає true
//порівняння true < 1 дає false, оскільки true перетворюється на 1,а 1 не менше за 1
console.log((+null == false) < 1 ** 5); //відповідь false








